 IDENTIFICATION DIVISION.
 PROGRAM-ID. COUNTER.

 DATA DIVISION.
    WORKING-STORAGE SECTION.
    01 WS-WHAT PIC 9 VALUE 0.
    01 WS-I PIC 9(2) VALUE 0.
    01 WS-J PIC 9(2) VALUE 0.
    01 WS-HELP PIC 9(2) VALUE 0.
    01 WS-TEMP.
       05 WS-C1 OCCURS 3 TIMES.
       10 WS-D1 PIC X(1) VALUE '.'.
    01 COUNTER PIC 9(2) VALUE 1.
    LINKAGE SECTION.
    01 WS-COUNTER PIC 9(2) VALUE 0.
    01 WS-TABLE.
       05 WS-A OCCURS 3 TIMES INDEXED BY I.
       10 WS-C OCCURS 7 TIMES.
          15 WS-D PIC X(1) VALUE '.'.

 PROCEDURE DIVISION USING WS-TABLE, WS-COUNTER.
    PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I>3
      PERFORM VARYING WS-J FROM 1 BY 1 UNTIL WS-J>7
        IF WS-C(WS-I,WS-J) = '#'
          ADD 1 TO WS-COUNTER
        END-IF
      END-PERFORM
    END-PERFORM
    
  EXIT PROGRAM.
