IDENTIFICATION DIVISION.
PROGRAM-ID. CREATE-RECT.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-TEMP.
      05 WS-C1 OCCURS 7 TIMES.
         10 WS-D1 PIC X(1) VALUE '.'.
   LINKAGE SECTION.
   01 WS-WIDTH PIC 9(2) VALUE 1.
   01 WS-HEIGHT PIC 9(2) VALUE 1.
   01 WS-TABLE.
      05 WS-A OCCURS 3 TIMES INDEXED BY I.
         10 WS-C OCCURS 7 TIMES.
            15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION USING WS-TABLE, WS-WIDTH, WS-HEIGHT.
   MOVE '#' TO WS-C(1,1)
   MOVE '#' TO WS-C(1,2)
   MOVE '#' TO WS-C(1,3)
   MOVE '#' TO WS-C(2,1)
   MOVE '#' TO WS-C(2,2)
   MOVE '#' TO WS-C(2,3)
EXIT PROGRAM.
