IDENTIFICATION DIVISION.
PROGRAM-ID. CREATE-RECT.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-TEMP.
      05 WS-C1 OCCURS 50 TIMES.
         10 WS-D1 PIC X(1) VALUE '.'.
   01 HEIGHT-INDEX PIC 9(2) VALUE 1.
   01 WIDTH-INDEX PIC 9(2) VALUE 1.
   01 ColumnIndex PIC 999.
   01 RowIndex PIC 999.
   LINKAGE SECTION.
   01 WS-WIDTH PIC 9(2) VALUE 1.
   01 WS-HEIGHT PIC 9(2) VALUE 1.
   01 WS-TABLE.
      05 WS-A OCCURS 6 TIMES INDEXED BY I.
         10 WS-C OCCURS 50 TIMES.
            15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION USING WS-TABLE, WS-WIDTH, WS-HEIGHT.
   A-PARA.
   PERFORM ADD-ROW VARYING RowIndex FROM 1 BY 1 UNTIL RowIndex > WS-HEIGHT
EXIT PROGRAM.

   ADD-COLUMN.
      MOVE '#' TO WS-C(RowIndex,ColumnIndex).

   ADD-ROW.
      MOVE '#' TO WS-C(RowIndex, ColumnIndex).
      PERFORM ADD-COLUMN VARYING ColumnIndex FROM 1 BY 1 UNTIL ColumnIndex > WS-WIDTH.
      MOVE 1 TO ColumnIndex.
