IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

ENVIRONMENT DIVISION.          

DATA DIVISION.

  WORKING-STORAGE SECTION.
  01 WS-LINE.
     05 WS-STUDENT-ID PIC 9(5).
     05 WS-NAME PIC A(25).
  01 WS-EOF PIC A(1).
  01 ACTION PIC X(10).
  01 DIRECTION PIC X(10).
  01 WS-STR3 PIC X(10).
  01 CELL PIC 9(2).
  01 CELL-STR PIC X(10).
  01 SCRAP PIC X(10).
  01 WS-STR-BY PIC X(10).
  01 WS-TIMES PIC 9(2).
  01 RECT-WIDTH PIC 9(2).
  01 RECT-HEIGHT PIC 9(2).
  01 WS-TABLE.
     05 WS-A OCCURS 3 TIMES INDEXED BY I.
     10 WS-C OCCURS 3 TIMES INDEXED BY J.
        15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION.
   MOVE 'A' TO WS-C(1,1)
   MOVE 'B' TO WS-C(1,2)
   MOVE 'C' TO WS-C(1,3)
   MOVE 'D' TO WS-C(2,1)
   MOVE 'E' TO WS-C(2,2)
   MOVE 'F' TO WS-C(2,3)
   MOVE 'G' TO WS-C(3,1)
   MOVE 'H' TO WS-C(3,2)
   MOVE 'I' TO WS-C(3,3)
   DISPLAY WS-C(1,1).
STOP RUN.