IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 WS-TIMES PIC 9(2) VALUE 1.
  01 WS-ROW PIC 9(2) VALUE 1.
  01 WS-WHAT PIC 9(2) VALUE 1.
  01 WS-COLUMN PIC 9(2) VALUE 2.
  01 RECT-WITDTH PIC 9(2) VALUE 3.
  01 RECT-HEIGHT PIC 9(2) VALUE 2.
  01 WS-TEMP.
     05 WS-C1 OCCURS 7 TIMES.
     10 WS-D1 PIC X(1) VALUE '.'.
  01 WS-TABLE.
     05 WS-A OCCURS 3 TIMES INDEXED BY I.
     10 WS-C OCCURS 7 TIMES INDEXED BY J.
        15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION.
  PERFORM 4 TIMES
    DISPLAY '4 Times'
    PERFORM VARYING WS-WHAT FROM 1 BY 1 UNTIL WS-WHAT>2
      DISPLAY '3 Times'
    END-PERFORM
  END-PERFORM

STOP RUN.

 *> 0 index to 1 index compensation
