IDENTIFICATION DIVISION.
PROGRAM-ID. MAIN.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-TIMES PIC 9(2) VALUE 1.
   01 WS-ROW PIC 9(1) VALUE 1.
   01 WS-COLUMN PIC 9(1) VALUE 2.
   01 WS-TEMP.
      05 WS-C1 OCCURS 7 TIMES.
         10 WS-D1 PIC X(1) VALUE '.'.  
   01 WS-TABLE.
      05 WS-A OCCURS 3 TIMES INDEXED BY I.
         10 WS-C OCCURS 7 TIMES INDEXED BY J.
            15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION.
   MOVE '#' TO WS-C(1,1)
   MOVE '#' TO WS-C(1,2)
   MOVE '#' TO WS-C(1,3)
   MOVE '#' TO WS-C(2,1)
   MOVE '#' TO WS-C(2,2)
   MOVE '#' TO WS-C(2,3)
   CALL 'PRINT-TABLE' USING WS-TABLE.

   MOVE 2 TO WS-COLUMN
   MOVE 1 TO WS-TIMES
   *>CALL 'MOVE-COLUMN' USING WS-TABLE, WS-COLUMN, WS-TIMES.
   MOVE 3 TO WS-TIMES
   CALL 'MOVE-ROW' USING WS-TABLE, WS-ROW, WS-TIMES.

   CALL 'PRINT-TABLE' USING WS-TABLE.

STOP RUN.

*> 0 index to 1 index compensation