IDENTIFICATION DIVISION.
PROGRAM-ID. MOVE-ROW.

DATA DIVISION.
   WORKING-STORAGE SECTION.
   01 WS-HELP PIC 9(2).
   01 WS-INDEX PIC 9(2).
   01 WS-TEMP.
      05 WS-C1 OCCURS 50 TIMES.
         10 WS-D1 PIC X(1) VALUE '.'.
   LINKAGE SECTION.
   01 WS-TIMES PIC 9(2).
   01 WS-ROW PIC 9(2).
   01 WS-TABLE.
      05 WS-A OCCURS 6 TIMES INDEXED BY I.
         10 WS-C OCCURS 50 TIMES.
            15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION USING WS-TABLE, WS-ROW, WS-TIMES.
   PERFORM WS-TIMES TIMES
      MOVE WS-A(WS-ROW) TO WS-TEMP
      PERFORM VARYING WS-INDEX FROM 1 BY 1 UNTIL WS-INDEX>50

         IF WS-INDEX = 50
            MOVE WS-C1(50) TO WS-C(WS-ROW,1)
         ELSE
            SET WS-HELP TO WS-INDEX
            ADD 1 to WS-HELP
            MOVE WS-C1(WS-INDEX) TO WS-C(WS-ROW,WS-HELP)
         END-IF
      END-PERFORM
   END-PERFORM
EXIT PROGRAM.
