IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.
  INPUT-OUTPUT SECTION.
     FILE-CONTROL.
     SELECT STUDENT ASSIGN TO 'input.txt'
     ORGANIZATION IS LINE SEQUENTIAL.            

DATA DIVISION.
  FILE SECTION.
  FD STUDENT.
  01 STUDENT-FILE.
     05 STUDENT-ID PIC 9(5).
     05 NAME PIC A(25).

  WORKING-STORAGE SECTION.
  01 WS-STUDENT.
     05 WS-STUDENT-ID PIC 9(5).
     05 WS-NAME PIC A(25).
  01 WS-EOF PIC A(1).
  01 ACTION PIC X(10).
  01 DIRECTION PIC X(10).
  01 WS-STR3 PIC X(10).
  01 CELL PIC X(10).
  01 WS-TIMES PIC 9(2).
  01 WS-STR-BY PIC X(10).
  01 RECT-WIDTH PIC 9(2).
  01 RECT-HEIGHT PIC 9(2).

PROCEDURE DIVISION.
  OPEN INPUT STUDENT.
     PERFORM UNTIL WS-EOF='Y'
     READ STUDENT INTO WS-STUDENT
        AT END MOVE 'Y' TO WS-EOF
        NOT AT END
            UNSTRING WS-STUDENT DELIMITED BY SPACE
                INTO ACTION, DIRECTION, CELL, WS-STR-BY, WS-TIMES
            END-UNSTRING
            IF ACTION = 'rect'
                UNSTRING DIRECTION DELIMITED BY 'x'
                    INTO RECT-WIDTH, RECT-HEIGHT
                END-UNSTRING
                DISPLAY 'rect 'RECT-WIDTH'--'RECT-HEIGHT 
            ELSE
                IF DIRECTION = 'column'
                    DISPLAY 'should be column' WS-STR-BY
                ELSE
                    DISPLAY 'should be row' WS-STR-BY
                END-IF
            END-IF
     END-READ
     END-PERFORM.
  CLOSE STUDENT.
STOP RUN.