IDENTIFICATION DIVISION.
PROGRAM-ID. PRINT-TABLE.

DATA DIVISION.
   LINKAGE SECTION.
   01 LS-STUDENT-ID PIC 9(4).
   01 LS-STUDENT-NAME PIC A(15).
   01 WS-COUNT PIC 9(1) VALUE 1.
   01 WS-TABLE.
      05 WS-A OCCURS 3 TIMES.
         10 WS-C OCCURS 7 TIMES.
            15 WS-D PIC X(1) VALUE '.'.

PROCEDURE DIVISION USING WS-TABLE.
   DISPLAY WS-A(1).
   DISPLAY WS-A(2).
   DISPLAY WS-A(3).
   DISPLAY ' '.
EXIT PROGRAM.
